# Read data from three ways
* Excel
* CSV
* HTML

In [1]:
# %pip install numpy
# %pip install pandas
# %pip install openpyxl
# %pip install lxml
# %pip install requests
# %pip install html5lib
#%pip install beautifulsoup4

In [2]:
import numpy as np
import pandas as pd

# Read Excel & CSV File

In [3]:
pd.read_excel('SamplePandas_A.xlsx')

        Name          City  Age             Job
0      Sajid           Rio   56      Journalist
1       Sami  Kuala Lumpur   69  Data Scientist
2      Frank        Dallas   10          Singer
3        Raj      New York   63      Journalist
4       John    Manchester   40        Engineer
5   Franklin        Mumbay   17        Engineer
6      Mitul      Singapor   46        Engineer
7      Hamza      Bengalor   50       Physicist
8    Eduardo         Perth   68        Youtuber
9   Cristina        Berlin   26          Writer
10    Erling      Montreal   39         Teacher

In [4]:
# To get data from another sheet do 
pd.read_excel('SamplePandas_A.xlsx', sheet_name='Sheet2')

       Name          City  Age             Job
0     Sajid           Rio   28      Journalist
1      Sami  Kuala Lumpur   72  Data Scientist
2     Frank        Dallas   28          Singer
3       Raj      New York   68      Journalist
4      John    Manchester   80        Engineer
5  Franklin        Mumbay   50        Engineer
6     Mitul      Singapor   61        Engineer

In [5]:
data =pd.read_excel('SamplePandas_B.xlsx',skiprows=3)
data = data.dropna(axis=1, how="all")

print(data)

        Name          City  Age             Job
0      Sajid           Rio   48      Journalist
1       Sami  Kuala Lumpur   78  Data Scientist
2      Frank        Dallas   62          Singer
3        Raj      New York   14      Journalist
4       John    Manchester   49        Engineer
5   Franklin        Mumbay   75        Engineer
6      Mitul      Singapor   49        Engineer
7      Hamza      Bengalor   40       Physicist
8    Eduardo         Perth   31        Youtuber
9   Cristina        Berlin   27          Writer
10    Erling      Montreal   74         Teacher

In [6]:
pd.read_csv('SamplePandas_C.csv')

       Name      City  Age         Job
0     Sajid       Rio   12  Journalist
1  Franklin    Mumbay   60    Engineer
2     Mitul  Singapor   77    Engineer
3     Hamza  Bengalor   12   Physicist
4   Eduardo     Perth   66    Youtuber
5  Cristina    Berlin   18      Writer
6    Erling  Montreal   21     Teacher

# Read Web & HTML data

In [15]:
# Read Excel & CSV File
import pandas as pd
import requests
from io import StringIO

url = "https://en.wikipedia.org/wiki/Texas"
headers = {"User-Agent": "Mozilla/5.0"}

response = requests.get(url, headers=headers)

wiki_data = pd.read_html(StringIO(response.text),match='language')
wiki_data[1]

                 Language Population (as of 2010)[226]
0                 Spanish                        29.2%
1              Vietnamese                         0.8%
2                 Chinese                         0.6%
3                  German                         0.3%
4                 Tagalog                         0.3%
5                  French                         0.3%
6  Korean and Urdu (tied)                         0.2%
7                   Hindi                         0.2%
8                  Arabic                         0.2%
9   Niger-Congo languages                         0.2%

In [20]:
# Temperatures in Texas? 
wiki_data = pd.read_html(StringIO(response.text),match='temperature')
texas_temp = wiki_data[0]
texas_temp

      Location August (°F) August (°C) January (°F) January (°C)
0      Houston       94/75       34/24        63/54        17/12
1  San Antonio       96/74       35/23        63/40         17/5
2       Dallas       96/77       36/25        57/37         16/3
3       Austin       97/74       36/23        61/45         16/5
4      El Paso       92/67       33/21        57/32         14/0
5       Laredo      100/77       37/25        67/46         19/7
6     Amarillo       89/64       32/18        50/23        10/−4
7  Brownsville       94/76       34/24        70/51        21/11

In [ ]:
texas_temp.Location # use df.Column

0        Houston
1    San Antonio
2         Dallas
3         Austin
4        El Paso
5         Laredo
6       Amarillo
7    Brownsville
Name: Location, dtype: object

In [ ]:
texas_temp["August (°F)"]

0     94/75
1     96/74
2     96/77
3     97/74
4     92/67
5    100/77
6     89/64
7     94/76
Name: August (°F), dtype: object

In [25]:
# That is not very informative let's add another column to help
# This will  return the location and August temperatures
texas_temp[['Location', "August (°F)"]]

      Location August (°F)
0      Houston       94/75
1  San Antonio       96/74
2       Dallas       96/77
3       Austin       97/74
4      El Paso       92/67
5       Laredo      100/77
6     Amarillo       89/64
7  Brownsville       94/76

# Index a column

In [ ]:
texas_temp.set_index('Location') # This is a temp change

            August (°F) August (°C) January (°F) January (°C)
Location
Houston           94/75       34/24        63/54        17/12
San Antonio       96/74       35/23        63/40         17/5
Dallas            96/77       36/25        57/37         16/3
Austin            97/74       36/23        61/45         16/5
El Paso           92/67       33/21        57/32         14/0
Laredo           100/77       37/25        67/46         19/7
Amarillo          89/64       32/18        50/23        10/−4
Brownsville       94/76       34/24        70/51        21/11

In [27]:
texas_temp

      Location August (°F) August (°C) January (°F) January (°C)
0      Houston       94/75       34/24        63/54        17/12
1  San Antonio       96/74       35/23        63/40         17/5
2       Dallas       96/77       36/25        57/37         16/3
3       Austin       97/74       36/23        61/45         16/5
4      El Paso       92/67       33/21        57/32         14/0
5       Laredo      100/77       37/25        67/46         19/7
6     Amarillo       89/64       32/18        50/23        10/−4
7  Brownsville       94/76       34/24        70/51        21/11

In [28]:
# To make the change permanent pass inplace = True
texas_temp.set_index('Location', inplace=True) # This is a temp change

In [29]:
texas_temp

            August (°F) August (°C) January (°F) January (°C)
Location
Houston           94/75       34/24        63/54        17/12
San Antonio       96/74       35/23        63/40         17/5
Dallas            96/77       36/25        57/37         16/3
Austin            97/74       36/23        61/45         16/5
El Paso           92/67       33/21        57/32         14/0
Laredo           100/77       37/25        67/46         19/7
Amarillo          89/64       32/18        50/23        10/−4
Brownsville       94/76       34/24        70/51        21/11